neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32F4.c
        return hwDMA_OK;
}

static void* DMA_Get_Instance(hwDMA_Stream_Index stream_index)
{
    if (stream_index >= hwDMA_Stream_Index_MAX)
    {
        return NULL;
    }

    return DMA_Map_Soc_Stream_Base(stream_index);
}

static hwDMA_OpResult DMA_DeConfig(hwDMA_Stream_Index stream_index)
{
    if (stream_index >= hwDMA_Stream_Index_MAX)
    {
        return hwDMA_InvalidParameter;
    }

    if (DMA_Stream_Init_Status[stream_index] == false)
    {
        return hwDMA_NotInit;
    }

    if (g_dma[stream_index].Instance != NULL)
    {
        HAL_DMA_Abort(&g_dma[stream_index]);

        if (HAL_DMA_DeInit(&g_dma[stream_index]) != HAL_OK)
        {
            return hwDMA_HwError;
        }
    }

    memset(&g_dma[stream_index], 0, sizeof(DMA_HandleTypeDef));

    return hwDMA_OK;
}

static hwDMA_OpResult DMA_Config_UART(hwDMA_Stream_Index stream_index, hwDMA_Peripheral_Direction dir, hwUART_Index index)
{
        if(dir>=hwDMA_Peripheral_Direction_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(stream_index>=hwDMA_Stream_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(index>=hwUART_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if (DMA_Stream_Init_Status[stream_index] == false)
        {
                return hwDMA_NotInit;
        }

        g_dma[stream_index].Instance = DMA_Get_Instance(stream_index);
        if (g_dma[stream_index].Instance == NULL)
        {
                return hwDMA_InvalidParameter;
        }

        g_dma[stream_index].Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
        g_dma[stream_index].Init.PeriphInc           = DMA_PINC_DISABLE;
        g_dma[stream_index].Init.MemInc              = DMA_MINC_ENABLE;
        g_dma[stream_index].Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        g_dma[stream_index].Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
        g_dma[stream_index].Init.Mode                = DMA_NORMAL;
        g_dma[stream_index].Init.Priority            = DMA_PRIORITY_HIGH;
        g_dma[stream_index].Init.FIFOMode            = DMA_FIFOMODE_DISABLE;

        switch (dir)
        {
                case hwDMA_Peripheral_Direction_TX:
                        g_dma[stream_index].Init.Direction = DMA_MEMORY_TO_PERIPH;

                        switch (index)
                        {
#if defined (UART1_BASE) || defined(USART1_BASE)
                                case hwUART_Index_0:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_4;
                                        break;
#endif
#if defined (UART2_BASE) || defined(USART2_BASE)
                                case hwUART_Index_1:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_4;
                                        break;
#endif
#if defined (UART3_BASE) || defined(USART3_BASE)
                                case hwUART_Index_2:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_4;
                                        break;
#endif
#if defined (UART4_BASE) || defined(USART4_BASE)
                                case hwUART_Index_3:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_4;
                                        break;
#endif
#if defined (UART5_BASE) || defined(USART5_BASE)
                                case hwUART_Index_4:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_4;
                                        break;
#endif
#if defined (UART6_BASE) || defined(USART6_BASE)
                                case hwUART_Index_5:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_5;
                                        break;
#endif
                        }
                        break;

                case hwDMA_Peripheral_Direction_RX:
                        g_dma[stream_index].Init.Direction = DMA_PERIPH_TO_MEMORY;

                        switch (index)
                        {
#if defined (UART1_BASE) || defined(USART1_BASE)
                                case hwUART_Index_0:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_4;
                                        break;
#endif
#if defined (UART2_BASE) || defined(USART2_BASE)
                                case hwUART_Index_1:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_4;
                                        break;
#endif
#if defined (UART3_BASE) || defined(USART3_BASE)
                                case hwUART_Index_2:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_4;
                                        break;
#endif
#if defined (UART4_BASE) || defined(USART4_BASE)
                                case hwUART_Index_3:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_4;
                                        break;
#endif
#if defined (UART5_BASE) || defined(USART5_BASE)
                                case hwUART_Index_4:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_4;
                                        break;
#endif
#if defined (UART6_BASE) || defined(USART6_BASE)
                                case hwUART_Index_5:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_5;
                                        break;
#endif
                        }
                        break;
        }

        if (HAL_DMA_Init(&g_dma[stream_index]) != HAL_OK)
        {
                return hwDMA_HwError;
        }

        switch (dir)
        {
                case hwDMA_Peripheral_Direction_TX:
                        __HAL_LINKDMA(&g_uart[index], hdmatx, g_dma[stream_index]);
                        break;

                case hwDMA_Peripheral_Direction_RX:
                        __HAL_LINKDMA(&g_uart[index], hdmarx, g_dma[stream_index]);
                        break;
        }

